Titanic Dataset

Import the necessary libraries

In [15]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [16]:
# import the dataset from data folder using read_csv in pandas library 
df_titanic = pd.read_csv('data/titanic.csv')

In [17]:
# Show how many observation we have in the data
df_titanic.shape

(891, 11)

In [18]:
# Display more information about the data
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   name      891 non-null    object
 3   gender    891 non-null    object
 4   age       714 non-null    float64
 5   sibsp     891 non-null    int64
 6   parch     891 non-null    int64
 7   ticket    891 non-null    object
 8   fare      891 non-null    float64
 9   cabin     204 non-null    object
 10  embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

In [20]:
# Print the unique values of every column if the number of unique values in that column is 10 or less.
for col in df_titanic:
    if df_titanic[col].nunique() <= 10:
        print(col,df_titanic[col].unique())

survived [0 1]
pclass [3 1 2]
gender ['male' 'female']
sibsp [1 0 3 4 2 5 8]
parch [0 1 2 5 3 4 6]
embarked ['S' 'C' 'Q' nan]

In [19]:
# Display a random sample from the data
df_titanic.sample(5)

,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
571,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S
453,1,1,"Goldenberg, Mr. Samuel L",male,49.0,1,0,17453,89.1042,C92,C
723,0,2,"Hodges, Mr. Henry Price",male,50.0,0,0,250643,13.0000,NaN,S
254,0,3,"Rosblom, Mrs. Viktor (Helena Wilhelmina)",female,41.0,0,2,370129,20.2125,NaN,S
425,0,3,"Wiseman, Mr. Phillippe",male,NaN,0,0,A/4. 34244,7.2500,NaN,S

In [ ]:
#Data Dictionary:
# survived - survived or not (0  = did not survive, 1 = survived)
# p class ( 1= upper class, 2 = middle class, 3 = lower class)
# name (last name, first middel (maiden))
# gender (female, or male)
# age 
# sibsp	- number of siblings and spouses aboard the ship
# parch - number of parents or children aboard the ship
# ticket - ticket number
# fare - ticket price or fair (in what units? euro? pounds?)
# cabin - cabin number
# embarked - port of embarkation:
#       - C = cherbourg
#       - Q = Queenstown
#       - S = Southampton

In [21]:
# To know how many male/female in the ship
df_titanic.gender.value_counts()

male      577
female    314
Name: gender, dtype: int64